InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикСтраховыхВзносовПФР_ФФОМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИПТарифыФиксированныхВзносов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИПТарифыФиксированныхВзносов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИПТарифыФиксированныхВзносов</Name>
			<Comment>Тарифы фиксированных взносов ИП согласно ст. 430 НК РФ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единый</Name>
					<Comment>Единый тариф согласно п.1.2 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйПенсионер</Name>
					<Comment>Тариф для военных пенсионеров согласно п.1.4. ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникСЭЗнаНТ</Name>
					<Comment>Тариф для участника СЭЗ в соответствии с п.1.3 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает значения регистра по умолчанию
//
// Параметры:
//   Запись - РегистрСведенийЗапись
//   ДанныеЗаполнения - Структура - где ключ - имя ресурса
//
Процедура УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения) Экспорт
	
	УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		ТекущаяДатаСеанса());
	
	УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Организация",
			УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
	Пользователи.ТекущийПользователь(),
	"ОсновнаяОрганизация"));
		
	ЭтоЮрЛицо = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Запись.Организация);
		
	Если ЭтоЮрЛицо Тогда
		Запись.Организация = Справочники.Организации.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	ПлательщикСтраховыхВзносовПФР_ФФОМС = ПлательщикСтраховыхВзносов(ДанныеЗаполнения);
	Если ПлательщикСтраховыхВзносовПФР_ФФОМС Тогда
		УстановитьЗначениеПоУмолчанию(
			Запись,
			ДанныеЗаполнения,
			"Тариф",
			Перечисления.ИПТарифыФиксированныхВзносов.Единый);
	КонецЕсли;
	
	УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ПлательщикСтраховыхВзносовПФР_ФФОМС",
		ПлательщикСтраховыхВзносовПФР_ФФОМС);
	
КонецПроцедуры

// Присваивает ресурсу регистра значение по умолчанию, в случае,
// если в данных заполнения заполнение реквизита не предусмотрено
// 
// Параметры:
//  Запись              - запись регистра сведений.
//  ДанныеЗаполнения    - Структура - содержит данные для заполнения ресурсов регистра,
//                      где имя ключа соответствует имени ресурса.
//  ИмяРесурса          - Строка - имя ресурса, оторому присваивается значение.
//  ЗначениеПоУмолчанию - Произвольный - значение по умолчанию, соответствующее типу ресурса.
//
//@skip-check doc-comment-field-type
//@skip-check doc-comment-field-type-strict
Процедура УстановитьЗначениеПоУмолчанию(Запись, ДанныеЗаполнения, ИмяРесурса, ЗначениеПоУмолчанию) Экспорт
	
	Если Не ДанныеЗаполнения.Свойство(ИмяРесурса, Запись[ИмяРесурса]) Тогда
		Запись[ИмяРесурса] = ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает интервалы, в течение которых ИП не оплачивает страховые взносы в ПФР и ФФОМС
//
// Параметры:
//  Организация - СправочникСсылка.Организация
//  ДатаНачала - Дата
//  ДатаОкончания - Дата
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * ДатаНачала - Дата
//   * ДатаОкончания - Дата
//
//@skip-check doc-comment-type
Функция ИнтервалыИПНеОплачиваетСтраховыеВзносы(Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	Интервалы = Новый ТаблицаЗначений;
	ТипДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	Интервалы.Колонки.Добавить("ДатаНачала", ТипДата);
	Интервалы.Колонки.Добавить("ДатаОкончания", ТипДата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.Период КАК Период,
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.ПлательщикСтраховыхВзносовПФР_ФФОМС КАК ПлательщикСтраховыхВзносовПФР_ФФОМС
		|ИЗ
		|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СрезПоследних(&ДатаНачала, Организация = &Организация) КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних
		|ГДЕ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.Период < &ДатаНачала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период,
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ПлательщикСтраховыхВзносовПФР_ФФОМС
		|ИЗ
		|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|ГДЕ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация = &Организация
		|	И НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредыдущаяСтрока = Неопределено;
	ЭтоПерваяСтрока = Истина;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПлательщикСтраховыхВзносовПФР_ФФОМС И ПредыдущаяСтрока <> Неопределено
			И Не ЗначениеЗаполнено(ПредыдущаяСтрока.ДатаОкончания) Тогда
			ПредыдущаяСтрока.ДатаОкончания = НачалоДня(Выборка.Период) - 1;
		ИначеЕсли Не Выборка.ПлательщикСтраховыхВзносовПФР_ФФОМС Тогда
			НоваяСтрока = Интервалы.Добавить();
			НоваяСтрока.ДатаНачала = ?(Выборка.Период < ДатаНачала, ДатаНачала, Выборка.Период);
			Если ПредыдущаяСтрока <> Неопределено И Не ЗначениеЗаполнено(ПредыдущаяСтрока.ДатаОкончания) Тогда
				ПредыдущаяСтрока.ДатаОкончания = НачалоДня(Выборка.Период) - 1;
			КонецЕсли;
			ПредыдущаяСтрока = НоваяСтрока;
		КонецЕсли;
		Если ЭтоПерваяСтрока Тогда
			Если Выборка.Период > ДатаНачала Тогда
				НоваяСтрока = Интервалы.Вставить(0);
				НоваяСтрока.ДатаНачала = ДатаНачала;
				НоваяСтрока.ДатаОкончания = НачалоДня(Выборка.Период) - 1;
			КонецЕсли;
			ЭтоПерваяСтрока = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если ПредыдущаяСтрока <> Неопределено И Не ЗначениеЗаполнено(ПредыдущаяСтрока.ДатаОкончания) Тогда
		ПредыдущаяСтрока.ДатаОкончания = ДатаОкончания;
	КонецЕсли;
	
	Возврат Интервалы;
	
КонецФункции

// Добавляет в регистр сведений "НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС" новые записи, если
// значение ресурса "ПлательщикСтраховыхВзносовПФР_ФФОМС" поменялось. Это может произойти при изменении
// системы налогообложения ИП, снятии ИП с регистрации и обратной постановки ИП на учет
//
// Параметры:
//  НастройкиПлатежейСтраховыхВзносов - ТаблицаЗначений - см. НовыеНастройкиУчетаСтраховыхВзносов_ПФР_ФФОМС
//
//@skip-check doc-comment-complex-type-with-link
Процедура ОтразитьИзменениеНастройкиПлательщикСтраховыхВзносов(НастройкиПлатежейСтраховыхВзносов) Экспорт
	
	Если НастройкиПлатежейСтраховыхВзносов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Через параметр в запрос передаем новые настройки системы налогообложения, выбираем записи из предыдущей настройки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиУчетаСтраховыхВзносов.Организация КАК Организация,
		|	НастройкиУчетаСтраховыхВзносов.Период КАК Период,
		|	НастройкиУчетаСтраховыхВзносов.УплачиваютсяСтраховыеВзносы КАК УплачиваютсяСтраховыеВзносы,
		|	НастройкиУчетаСтраховыхВзносов.ПлательщикАУСН КАК ПлательщикАУСН,
		|	НастройкиУчетаСтраховыхВзносов.ДатаИзменения КАК ДатаИзменения
		|ПОМЕСТИТЬ ВТ_ИзменяемыеДанные
		|ИЗ
		|	&НастройкиУчетаСтраховыхВзносов КАК НастройкиУчетаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИзменяемыеДанные.Организация КАК Организация,
		|	ВТ_ИзменяемыеДанные.Период КАК Период,
		|	ВТ_ИзменяемыеДанные.УплачиваютсяСтраховыеВзносы КАК УплачиваютсяСтраховыеВзносы,
		|	ВТ_ИзменяемыеДанные.ПлательщикАУСН КАК ПлательщикАУСН,
		|	ВТ_ИзменяемыеДанные.ДатаИзменения КАК ДатаИзменения,
		|	МАКСИМУМ(ЕСТЬNULL(СистемыНалогообложенияОрганизаций.Период, ВТ_ИзменяемыеДанные.Период)) КАК
		|		ПериодНастроекСистемыНалогообложения,
		|	МАКСИМУМ(ЕСТЬNULL(НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период, ВТ_ИзменяемыеДанные.ДатаИзменения)) КАК
		|		ПериодНастроекУчетаСтраховыхВзносов
		|ПОМЕСТИТЬ ПериодыНастроек
		|ИЗ
		|	ВТ_ИзменяемыеДанные КАК ВТ_ИзменяемыеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СистемыНалогообложенияОрганизаций КАК СистемыНалогообложенияОрганизаций
		|		ПО ВТ_ИзменяемыеДанные.Организация = СистемыНалогообложенияОрганизаций.Организация
		|		И ВТ_ИзменяемыеДанные.Период >= СистемыНалогообложенияОрганизаций.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК
		|			НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|		ПО ВТ_ИзменяемыеДанные.Организация = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация
		|		И ВТ_ИзменяемыеДанные.ДатаИзменения >= НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИзменяемыеДанные.Организация,
		|	ВТ_ИзменяемыеДанные.Период,
		|	ВТ_ИзменяемыеДанные.УплачиваютсяСтраховыеВзносы,
		|	ВТ_ИзменяемыеДанные.ПлательщикАУСН,
		|	ВТ_ИзменяемыеДанные.ДатаИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыНастроек.Организация КАК Организация,
		|	ПериодыНастроек.УплачиваютсяСтраховыеВзносы КАК УплачиваютсяСтраховыеВзносы,
		|	ПериодыНастроек.ПлательщикАУСН КАК ПлательщикАУСН,
		|	ПериодыНастроек.ДатаИзменения КАК ДатаИзменения,
		|	ЕСТЬNULL(НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ПлательщикСтраховыхВзносовПФР_ФФОМС, НЕОПРЕДЕЛЕНО) КАК
		|		ПлательщикСтраховыхВзносов
		|ИЗ
		|	ПериодыНастроек КАК ПериодыНастроек
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СистемыНалогообложенияОрганизаций КАК СистемыНалогообложенияОрганизаций
		|		ПО ПериодыНастроек.Организация = СистемыНалогообложенияОрганизаций.Организация
		|		И ПериодыНастроек.ПериодНастроекСистемыНалогообложения = СистемыНалогообложенияОрганизаций.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК
		|			НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|		ПО ПериодыНастроек.Организация = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация
		|		И ПериодыНастроек.ПериодНастроекУчетаСтраховыхВзносов = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период";
	
	Запрос.Параметры.Вставить("НастройкиУчетаСтраховыхВзносов", НастройкиПлатежейСтраховыхВзносов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Проверяем, нужно ли изменить настройку плательщика страховых взносов
		// Выборка.ПлательщикСтраховыхВзносов - значение настройки на настоящий момент времени
		// Выборка.УплачиваютсяСтраховыеВзносы - признак уплаты взносов по системе налогообложения
		// Соответственно, если ИП стал плательщиком НПД или УСН-онлайн (не платит взносы), а ранее платил страховые взносы,
		// значит нужно добавить новую запись, с отключенным признаком плательщика и т.д.
		ПризнакПлательщикСтраховыхВзносов = Неопределено;
		Если Выборка.УплачиваютсяСтраховыеВзносы = Неопределено
			Или Выборка.ПлательщикСтраховыхВзносов = Неопределено
			Или Не Выборка.ПлательщикСтраховыхВзносов Тогда
			
			ПризнакПлательщикСтраховыхВзносов = Выборка.УплачиваютсяСтраховыеВзносы;
		ИначеЕсли Не Выборка.УплачиваютсяСтраховыеВзносы И Выборка.ПлательщикСтраховыхВзносов Тогда
			ПризнакПлательщикСтраховыхВзносов = Ложь;
		КонецЕсли;
		Если ПризнакПлательщикСтраховыхВзносов <> Неопределено Тогда
			//@skip-check manager-module-named-self-reference
			МенеджерЗаписи = РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Организация = Выборка.Организация;
			МенеджерЗаписи.Период = Выборка.ДатаИзменения;
			МенеджерЗаписи.ПлательщикСтраховыхВзносовПФР_ФФОМС = ПризнакПлательщикСтраховыхВзносов;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Находит и удаляет запись регистра "НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС", соответствующую
// удаляемой записи регистра "НастройкиСистемыНалогообложения", которая определяется по
// переданным через параметры значениям отбора
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Период - Дата
//
Процедура ПриУдаленииЗаписиНастройкиСистемыНалогообложения(Организация, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СистемыНалогообложенияОрганизаций.Период КАК ДатаИзменения,
		|	СистемыНалогообложенияОрганизаций.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ПараметрыУдаляемойЗаписи
		|ИЗ
		|	РегистрСведений.СистемыНалогообложенияОрганизаций КАК СистемыНалогообложенияОрганизаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация КАК Организация,
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период КАК Период
		|ИЗ
		|	ВТ_ПараметрыУдаляемойЗаписи КАК ВТ_ПараметрыУдаляемойЗаписи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК
		|			НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|		ПО ВТ_ПараметрыУдаляемойЗаписи.Организация = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация
		|		И ВТ_ПараметрыУдаляемойЗаписи.ДатаИзменения = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		//@skip-check manager-module-named-self-reference
		МенеджерЗаписи = РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Организация = Выборка.Организация;
		МенеджерЗаписи.Период = Выборка.Период;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак того, что в ИБ есть плательщики страховых взносов в ПФР и ФФОМС
//
// Возвращаемые значения:
//  Булево - признак уплаты страховых взносов в ПФР и ФФОМС
//
//@skip-check doc-comment-export-function-return-section
Функция УплачиваютсяСтраховыеВзносы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ПлательщикСтраховыхВзносов
	|ИЗ
	|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
	|ГДЕ
	|	НЕ НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация.ПометкаУдаления
	|	И НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ПлательщикСтраховыхВзносовПФР_ФФОМС";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Возвращает сведения о применяемом ИП тарифе страховых взносов в ПФР и ФФОМС на указанную дату
//
// Параметры:
//  Организация - СправочникСсылка.Организация
// Возвращаемое значение:
//  Структура:
//   * Период - Дата
//   * ПлательщикСтраховыхВзносовПФР_ФФОМС - Булево
//   * Тариф - Строка - Наименование тарифа
//
//@skip-check doc-comment-type
Функция ТарифСтраховыхВзносовИП(Организация) Экспорт
	
	СведенияОТарифе = Новый Структура;
	СведенияОТарифе.Вставить("Период", '00010101');
	СведенияОТарифе.Вставить("ПлательщикСтраховыхВзносовПФР_ФФОМС", Ложь);
	СведенияОТарифе.Вставить("Тариф", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.Период КАК Период,
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.ПлательщикСтраховыхВзносовПФР_ФФОМС КАК ПлательщикСтраховыхВзносовПФР_ФФОМС,
		|	ПРЕДСТАВЛЕНИЕ(НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.Тариф) КАК Тариф
		|ИЗ
		|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СрезПоследних(&Период, Организация = &Организация) КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СведенияОТарифе, Выборка);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат СведенияОТарифе;

КонецФункции

#Область ОбработчикиОбновления

// Заполнение первичное ресурса Тариф для ранее добавленных записей регистра
//
//@skip-check doc-comment-parameter-section
Процедура ЗаполнитьТарифФиксированныхВзносов(ПараметрыВыполнения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	НастройкиУчета.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчета
	|ГДЕ
	|	НастройкиУчета.Тариф = ЗНАЧЕНИЕ(Перечисление.ИПТарифыФиксированныхВзносов.ПустаяСсылка)
	|	И НастройкиУчета.ПлательщикСтраховыхВзносовПФР_ФФОМС";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыВыполнения.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	ПараметрыВыполнения.ОбработкаЗавершена = Ложь;
	
	ИмяПроцедуры = "РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ЗаполнитьТарифФиксированныхВзносов()";
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС");
			ЭлементБлокировки.УстановитьЗначение("Организация", Выборка.Организация);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			//@skip-check manager-module-named-self-reference
			НаборЗаписей = РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись Из НаборЗаписей Цикл
				
				Если Не ЗначениеЗаполнено(Запись.Тариф) Тогда
					Запись.Тариф = Перечисления.ИПТарифыФиксированныхВзносов.Единый;
				КонецЕсли;
				
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ЗафиксироватьТранзакцию();
			
		Исключение
			// Если не удалось обработать какую-либо запись, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОтменитьТранзакцию();
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'В процедуре %1 не удалось обработать организацию %2 по причине:
					|%3'"),
					ИмяПроцедуры,
					Выборка.Организация,
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС, Выборка.Организация, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ПроблемныхОбъектов > 0 Тогда
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Процедуре %1 не удалось обработать записи: в %2 из %3 возникли ошибки'"),
			ИмяПроцедуры,
			ПроблемныхОбъектов,
			ОбъектовОбработано);
		
		ВызватьИсключение ТекстСообщения;
		
	Иначе
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			Метаданные.РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС, ,
			СтрШаблон(НСтр("ru = 'Процедура %1 обработала очередную порцию записей: %2 записей'"),
				ИмяПроцедуры,
				ОбъектовОбработано));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Создает новые записи в регистре "НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС"
// при обновлении информационной базы
//
Процедура ЗаполнитьРегистр() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ОрганизацииВСуществующихЗаписях
		|ИЗ
		|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(СистемыНалогообложенияОрганизаций.Период) КАК ДатаИзменения,
		|	Организации.Ссылка КАК Организация,
		|	МИНИМУМ(ЛОЖЬ) КАК ПрименяетсяНалогНаПрофессиональныйДоход,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА СистемыНалогообложенияОрганизаций.СистемаНалогообложения ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК СистемаНалогообложенияНайдена
		|ИЗ
		|	РегистрСведений.СистемыНалогообложенияОрганизаций КАК СистемыНалогообложенияОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО СистемыНалогообложенияОрганизаций.Организация = Организации.Ссылка
		|ГДЕ
		|	НЕ Организации.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_ОрганизацииВСуществующихЗаписях.Организация КАК Организация
		|				ИЗ
		|					ВТ_ОрганизацииВСуществующихЗаписях КАК ВТ_ОрганизацииВСуществующихЗаписях)
		|	И Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|
		|СГРУППИРОВАТЬ ПО
		|	Организации.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация
		|ИТОГИ ПО
		|	Организация";
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		//@skip-check manager-module-named-self-reference
		НаборЗаписей = РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаОрганизация.Организация);
		Выборка = ВыборкаОрганизация.Выбрать();
		ПерваяЗапись = Истина;
		ПлательщикСтраховыхВзносов = Истина;
		Пока Выборка.Следующий() Цикл
			ТребуетсяДобавитьЗапись = ПерваяЗапись Или
				(Выборка.СистемаНалогообложенияНайдена И ПлательщикСтраховыхВзносов = Выборка.ПрименяетсяНалогНаПрофессиональныйДоход);
			Если Не ТребуетсяДобавитьЗапись Тогда
				Продолжить;
			КонецЕсли;
			Запись = НаборЗаписей.Добавить();
			Если Выборка.СистемаНалогообложенияНайдена Тогда
				Запись.Организация = Выборка.Организация;
//				Запись.Период = ?(ПерваяЗапись, Выборка.Период, Выборка.ДатаИзменения);
                Запись.Период = Выборка.ДатаИзменения;
				Запись.ПлательщикСтраховыхВзносовПФР_ФФОМС = Не Выборка.ПрименяетсяНалогНаПрофессиональныйДоход;
			Иначе
				ДанныеЗаполнения = Новый Структура;
				ДанныеЗаполнения.Вставить("Организация", Выборка.Организация);
				УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения);
			КонецЕсли;
			ПлательщикСтраховыхВзносов = Запись.ПлательщикСтраховыхВзносовПФР_ФФОМС;
			ПерваяЗапись = Ложь;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//@skip-check doc-comment-parameter-section
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОбособленныеПодразделения 
	|	ПО ОбособленныеПодразделения.ГоловнаяОрганизация = ЭтотСписок.Организация.ГоловнаяОрганизация
	|;
	|РазрешитьЧтение
	|ГДЕ
	| ЗначениеРазрешено(ОбособленныеПодразделения.Ссылка)
	|
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	| ЗначениеРазрешено(ЭтотСписок.Организация)";
	
КонецПроцедуры

Функция НовыеНастройкиУчетаСтраховыхВзносов_ПФР_ФФОМС() Экспорт
	
	НастройкиУчетаСтраховыхВзносов = Новый ТаблицаЗначений;
	ОписаниеТипаДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	НастройкиУчетаСтраховыхВзносов.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	НастройкиУчетаСтраховыхВзносов.Колонки.Добавить("Период", ОписаниеТипаДата);
	НастройкиУчетаСтраховыхВзносов.Колонки.Добавить("ДатаИзменения", ОписаниеТипаДата);
	НастройкиУчетаСтраховыхВзносов.Колонки.Добавить("УплачиваютсяСтраховыеВзносы", Новый ОписаниеТипов("Булево"));
	НастройкиУчетаСтраховыхВзносов.Колонки.Добавить("ПлательщикАУСН", Новый ОписаниеТипов("Булево"));
	Возврат НастройкиУчетаСтраховыхВзносов;
	
КонецФункции

//@skip-check module-structure-method-in-regions
Функция ПлательщикСтраховыхВзносов(ДанныеЗаполнения)
	
	ПлательщикАУСН = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ПрименяетсяАУСН", Ложь);
	
	Возврат Не ПлательщикАУСН;
	
КонецФункции

#КонецОбласти

#КонецЕсли
